#该文件是配置文件，所有的IP(sockt)等内容全配置在这里

QUEST_IP_AR = "172.20.10.9"    # MR 与 控制端 IP
QUEST_IP_RADAR = "172.20.10.9" # 雷达端 IP

# 端口配置
# ==========================================
# 跨端通信配置 (PC -> Unity)
# ==========================================
LINE_PORT = 50001              # Unity 路线端口，负责轨迹路线的 TCP 端口，将生成的路线tcp方式传给unity画线，后续算法来生成轨迹线
SPEED_PORT = 50002             # 速度端口，通过小键盘输入的车速（例如 "60km/h"）会由此发给 Unity 的 显示在头显上，后续接入can来实时读取发送
QUEST_PORT = 5005             # 3D 坐标发送端口，将位置信息（x，y，z）发送至unity,这个就是激光雷达摄像头识别车算出的中心点发送给unity显示在其画面上

# ==========================================
# 本地进程间通信配置 (PC 内部中转)
# ==========================================
DEPTH_PORT = 5006              # 本地深度接收端口，用于两个 Python 脚本在电脑内部交接距离数据。从CPP拿到深度距离信息后广播到5006这个端口，另一个脚本去拿5006这个端口数据结合摄像头像素差计算高度误差，俯仰角误差
UDP_PITCH_PORT = 50007         # 俯仰角同步端口，算出误差俯仰角发送到50007端口，另一脚本-----车道线算法----接收此端口数据算出线



# 车道线默认值
DEFAULT_LEFT = {"X_max": 40.0, "end_y": -3.5, "pitch": -6.0}
DEFAULT_RIGHT = {"X_max": 40.0, "end_y": 3.5, "pitch": -6.0}
# 微调步长设置
LENGTH_STEP, LATERAL_STEP, PITCH_STEP = 2.0, 0.2, 1.0

# 视觉参数，根据相机内参得到fy，，用于计算俯仰角
FY = 2282.118